src/talks.org
#+TITLE: talks | alex bellon
#+OPTIONS: title:nil

#+HTML: <div id="talks" class="main">
#+HTML: <div class="contentBlock">

** [[https://github.com/alex-bellon/talks/blob/master/Package-manager-security.pdf][package manager security]]
my final presentation for my mozilla internship, where i investigated the human element of programming language package compromises.
#+ATTR_HTML: :class publinks
[[[https://github.com/alex-bellon/talks/blob/master/Package-manager-security.pdf][slides]]] [[[https://youtu.be/oZegjBIRkk8][recording]]]

** [[https://github.com/alex-bellon/talks/blob/master/What-is-a-CTF.pdf][what is a ctf?]]
a brief overview of what a capture the flag competition is, how it works, how it's scored, and what kind of challenges you'll likely see.
#+ATTR_HTML: :class publinks
[[[https://github.com/alex-bellon/talks/blob/master/What-is-a-CTF.pdf][slides]]] [[[https://www.youtube.com/watch?v=uNV74WOBswQ][recording]]]

** [[https://github.com/alex-bellon/talks/blob/master/Forensics.pdf][forensics]]
a brief introduction to the "forensics" category of ctf challenges. mainly focusing on file formats.
#+ATTR_HTML: :class publinks
[[[https://github.com/alex-bellon/talks/blob/master/Forensics.pdf][slides]]] [[[https://youtu.be/wa1hFE423eI][recording]]]

** [[https://github.com/alex-bellon/talks/blob/master/Personal-Security-ISSS.pdf][personal security]]
a walkthrough of best practices (at the time of presentation :) ) for keeping yourself and your information safe.
#+ATTR_HTML: :class publinks
[[[https://github.com/alex-bellon/talks/blob/master/Personal-Security-ISSS.pdf][slides]]] [[[https://www.youtube.com/watch?v=lwc8Is8gjgY][recording]]]

** [[https://github.com/alex-bellon/talks/blob/master/Steganography.pdf][steganography]]
a deeper dive into a specific "forensics" topic, in which you hide data in other data without making it obvious that you have hidden any data at all.
#+ATTR_HTML: :class publinks
[[[https://github.com/alex-bellon/talks/blob/master/Steganography.pdf][slides]]]

** [[https://github.com/alex-bellon/talks/blob/master/Advanced-Linux.pdf][[acm cs101] advanced linux]]
a sequel to "intro to linux", this talk discusses more advanced commands and concepts you'll encounter using linux day to day.
#+ATTR_HTML: :class publinks
[[[https://github.com/alex-bellon/talks/blob/master/Advanced-Linux.pdf][slides]]]

** [[https://github.com/alex-bellon/talks/blob/master/Coding-Tools-and-Programs.pdf][[acm cs101] coding tools and programs]]
tools and programs that can make your coding experience much less painful :).
#+ATTR_HTML: :class publinks
[[[https://github.com/alex-bellon/talks/blob/master/Coding-Tools-and-Programs.pdf][slides]]]

** [[https://github.com/alex-bellon/talks/blob/master/Git-and-VCS.pdf][[acm cs101] git and version control]]
a brief rundown on the basics of version control (and specifically git), focusing on the most commonly used commands and operations.
#+ATTR_HTML: :class publinks
[[[https://github.com/alex-bellon/talks/blob/master/Git-and-VCS.pdf][slides]]]

** [[https://github.com/alex-bellon/talks/blob/master/Introduction-to-Linux.pdf][[acm cs101] intro to linux]]
a crash course on using linux to perform your day to day tasks, discussing basic commands and relevant topics.
#+ATTR_HTML: :class publinks
[[[https://github.com/alex-bellon/talks/blob/master/Introduction-to-Linux.pdf][slides]]]

** [[https://github.com/alex-bellon/talks/blob/master/SSH-and-(S)FTP.pdf][[acm cs101] ssh and sftp]]
a brief overview of what ssh/sftp are, and how to use them to move around your files and interact with remote machines.
#+ATTR_HTML: :class publinks
[[[https://github.com/alex-bellon/talks/blob/master/SSH-and-(S)FTP.pdf][slides]]]

** [[https://github.com/alex-bellon/talks/blob/master/Web-Workshop.pdf][web workshop]]
a tutorial for setting up a basic website using premade templates.
#+ATTR_HTML: :class publinks
[[[https://github.com/alex-bellon/talks/blob/master/Web-Workshop.pdf][slides]]]

#+HTML: </div></div>
