talks.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-09-12 Tue 17:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>talks | alex bellon</title>
<meta name="author" content="Alex Bellon" />
<meta name="generator" content="Org Mode" />
<link href='https://fonts.googleapis.com/css?family=Nunito' rel='stylesheet'>
<link rel='stylesheet' type='text/css' href='assets/css/main.css'>
<link rel='icon' type='image/png' href='./images/personal_logo.png'>
<meta name='viewport' content='width=device-width, initial-scale=.5'>
<meta charset='utf-8'/>
<base target='_blank'/>
</head>
<body>
<div id="preamble" class="status">
<ul class='header'>
    <li><a target='_parent' href='.'>home</a></li>
	<li><a target='_parent' href='./publications'>publications</a></li>
	<li><a target='_parent' href='./projects'>projects</a></li>
	<li><a target='_parent' href='./experience'>experience</a></li>
	<li><a target='_parent' href='./organizations'>organizations</a></li>
	<li><a target='_parent' href='./talks'>talks</a></li>
	<li><a target='_parent' href='./art'>art</a></li>
	<li><a target='_parent' href='./photography'>photography</a></li>
</ul>
</div>
<div id="content" class="content">
<div id="talks" class="main">
<div class="contentBlock">

<div id="outline-container-org8677704" class="outline-2">
<h2 id="org8677704"><a href="https://github.com/alex-bellon/talks/blob/master/Package-manager-security.pdf">package manager security</a></h2>
<div class="outline-text-2" id="text-org8677704">
<p>
my final presentation for my mozilla internship, where i investigated the human element of programming language package compromises.
</p>
<p class="publinks">
[<a href="https://github.com/alex-bellon/talks/blob/master/Package-manager-security.pdf" class="publinks">slides</a>] [<a href="https://youtu.be/oZegjBIRkk8">recording</a>]
</p>
</div>
</div>

<div id="outline-container-org6d59cbc" class="outline-2">
<h2 id="org6d59cbc"><a href="https://github.com/alex-bellon/talks/blob/master/What-is-a-CTF.pdf">what is a ctf?</a></h2>
<div class="outline-text-2" id="text-org6d59cbc">
<p>
a brief overview of what a capture the flag competition is, how it works, how it&rsquo;s scored, and what kind of challenges you&rsquo;ll likely see.
</p>
<p class="publinks">
[<a href="https://github.com/alex-bellon/talks/blob/master/What-is-a-CTF.pdf" class="publinks">slides</a>] [<a href="https://www.youtube.com/watch?v=uNV74WOBswQ">recording</a>]
</p>
</div>
</div>

<div id="outline-container-orgd28be02" class="outline-2">
<h2 id="orgd28be02"><a href="https://github.com/alex-bellon/talks/blob/master/Forensics.pdf">forensics</a></h2>
<div class="outline-text-2" id="text-orgd28be02">
<p>
a brief introduction to the &ldquo;forensics&rdquo; category of ctf challenges. mainly focusing on file formats.
</p>
<p class="publinks">
[<a href="https://github.com/alex-bellon/talks/blob/master/Forensics.pdf" class="publinks">slides</a>] [<a href="https://youtu.be/wa1hFE423eI">recording</a>]
</p>
</div>
</div>

<div id="outline-container-orgd54af43" class="outline-2">
<h2 id="orgd54af43"><a href="https://github.com/alex-bellon/talks/blob/master/Personal-Security-ISSS.pdf">personal security</a></h2>
<div class="outline-text-2" id="text-orgd54af43">
<p>
a walkthrough of best practices (at the time of presentation :) ) for keeping yourself and your information safe.
</p>
<p class="publinks">
[<a href="https://github.com/alex-bellon/talks/blob/master/Personal-Security-ISSS.pdf" class="publinks">slides</a>] [<a href="https://www.youtube.com/watch?v=lwc8Is8gjgY">recording</a>]
</p>
</div>
</div>

<div id="outline-container-orgf368f07" class="outline-2">
<h2 id="orgf368f07"><a href="https://github.com/alex-bellon/talks/blob/master/Steganography.pdf">steganography</a></h2>
<div class="outline-text-2" id="text-orgf368f07">
<p>
a deeper dive into a specific &ldquo;forensics&rdquo; topic, in which you hide data in other data without making it obvious that you have hidden any data at all.
</p>
<p class="publinks">
[<a href="https://github.com/alex-bellon/talks/blob/master/Steganography.pdf" class="publinks">slides</a>]
</p>
</div>
</div>

<div id="outline-container-org49dcc20" class="outline-2">
<h2 id="org49dcc20"><a href="https://github.com/alex-bellon/talks/blob/master/Advanced-Linux.pdf">[acm cs101] advanced linux</a></h2>
<div class="outline-text-2" id="text-org49dcc20">
<p>
a sequel to &ldquo;intro to linux&rdquo;, this talk discusses more advanced commands and concepts you&rsquo;ll encounter using linux day to day.
</p>
<p class="publinks">
[<a href="https://github.com/alex-bellon/talks/blob/master/Advanced-Linux.pdf" class="publinks">slides</a>]
</p>
</div>
</div>

<div id="outline-container-org9ebcc09" class="outline-2">
<h2 id="org9ebcc09"><a href="https://github.com/alex-bellon/talks/blob/master/Coding-Tools-and-Programs.pdf">[acm cs101] coding tools and programs</a></h2>
<div class="outline-text-2" id="text-org9ebcc09">
<p>
tools and programs that can make your coding experience much less painful :).
</p>
<p class="publinks">
[<a href="https://github.com/alex-bellon/talks/blob/master/Coding-Tools-and-Programs.pdf" class="publinks">slides</a>]
</p>
</div>
</div>

<div id="outline-container-org85e361e" class="outline-2">
<h2 id="org85e361e"><a href="https://github.com/alex-bellon/talks/blob/master/Git-and-VCS.pdf">[acm cs101] git and version control</a></h2>
<div class="outline-text-2" id="text-org85e361e">
<p>
a brief rundown on the basics of version control (and specifically git), focusing on the most commonly used commands and operations.
</p>
<p class="publinks">
[<a href="https://github.com/alex-bellon/talks/blob/master/Git-and-VCS.pdf" class="publinks">slides</a>]
</p>
</div>
</div>

<div id="outline-container-org36a5c36" class="outline-2">
<h2 id="org36a5c36"><a href="https://github.com/alex-bellon/talks/blob/master/Introduction-to-Linux.pdf">[acm cs101] intro to linux</a></h2>
<div class="outline-text-2" id="text-org36a5c36">
<p>
a crash course on using linux to perform your day to day tasks, discussing basic commands and relevant topics.
</p>
<p class="publinks">
[<a href="https://github.com/alex-bellon/talks/blob/master/Introduction-to-Linux.pdf" class="publinks">slides</a>]
</p>
</div>
</div>

<div id="outline-container-orgd60e796" class="outline-2">
<h2 id="orgd60e796"><a href="https://github.com/alex-bellon/talks/blob/master/SSH-and-(S)FTP.pdf">[acm cs101] ssh and sftp</a></h2>
<div class="outline-text-2" id="text-orgd60e796">
<p>
a brief overview of what ssh/sftp are, and how to use them to move around your files and interact with remote machines.
</p>
<p class="publinks">
[<a href="https://github.com/alex-bellon/talks/blob/master/SSH-and-(S)FTP.pdf" class="publinks">slides</a>]
</p>
</div>
</div>

<div id="outline-container-orgdab3130" class="outline-2">
<h2 id="orgdab3130"><a href="https://github.com/alex-bellon/talks/blob/master/Web-Workshop.pdf">web workshop</a></h2>
<div class="outline-text-2" id="text-orgdab3130">
<p>
a tutorial for setting up a basic website using premade templates.
</p>
<p class="publinks">
[<a href="https://github.com/alex-bellon/talks/blob/master/Web-Workshop.pdf" class="publinks">slides</a>]
</p>

</div></div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class='footer'>
    <ul class='header' style='margin-top:0px; margin-bottom:0px;'>
		<li><a target='_parent' href='./cv.pdf'>cv</a></li>
		<li><a target='_parent' href='https://github.com/alex-bellon'>github</a></li>
	</ul>
</div
</div>
</body>
</html>
